import streamlit as st

class Constants:
    
    AUTHENTICATION = False

    navigation_menu = [
        st.Page("pages/bills.py", title="Utility Bills"), 
        st.Page("pages/property_management.py", title="Property Management"), 
        st.Page("pages/budget_forecast.py", title="Budget & Forecast")
        ]
    
    DATAPATH = "data/input/"
    
    COLUMN_NAMES = [
        'ΔΙΑΔΡΟΜΗ',
        'ΑΡ.ΠΑΡΟΧΗΣ',
        'ΠΕΡΙΟΔΟΣ ΚΑΤΑΝΑΛΩΣΗΣ ΑΠΌ',
        'ΠΕΡΙΟΔΟΣ ΚΑΤΑΝΑΛΩΣΗΣ ΕΩΣ',
        'ΗΜΕΡ.ΛΗΞΕΩΣ',
        'ΗΜ.ΚΑΤΑΝΑΛΩΣΗΣ',
        'ΠΕΡΙΦ.ΓΡΑΦ.',
        'ΤΙΜΟΛΟΓΙΟ',
        'ΙΔΙΟΚΤΗΤΗΣ',
        'ΕΝΟΙΚΟΣ',
        'ΔΙΕΥΘΥΝΣΗ',
        'ΑΦΜ',
        'ΑΡ.ΜΕΤΡΗΤΗ',
        'ΔΙΑΜ.',
        'ΠΡΟΗΓ.ΕΝΔ.',
        'ΠΑΡ.ΕΝΔΕΙΞΗ',
        'ΤΕΚΜ.',
        'ΤΡΙΜ',
        'ΠΡΟΣΘ',
        'ΤΥΠΟΣ ΛΟΓΑΡΙΑΣΜΟΥ',
        'ΚΥΒΙΚΑ 1',
        'ΤΙΜΗΜΑ 1',
        'ΚΥΒΙΚΑ 2',
        'ΤΙΜΗΜΑ 2',
        'ΚΥΒ.3',
        'ΤΙΜ.3',
        'ΚΥΒ.4',
        'ΤΙΜΗΜΑ 4',
        'ΚΥΒ.5',
        'ΤΙΜΗΜΑ 5',
        'ΤΙΜΗΜΑ',
        'ΠΑΓΙΟ',
        'ΤΕΑΠ',
        'ΟΑΠ',
        'ΦΠΑ ΤΙΜ.',
        'ΦΠΑ ΛΟΙΠΩΝ',
        'ΕΡΓΑΣΙΕΣ',
        'ΔΙΑΦ.ΚΕΡΜ.',
        'ΚΥΡΙΑ ΟΦ.',
        'ΠΙΣΤΩΤΙΚΟ',
        'ΟΦΕΙΛΗ',
        'ΑΡ.ΠΑΡΑΣΤΑΤΙΚΟΥ',
        'ΗΜΕΡΟΜ.ΕΚΔΟΣΗΣ'
        ]

    NON_NULLABLE_COLUMNS = [
        'ΑΡ.ΠΑΡΟΧΗΣ',
        'ΚΥΡΙΑ ΟΦ.',
        'ΕΝΟΙΚΟΣ',
        'ΠΑΡ.ΕΝΔΕΙΞΗ',
        'ΑΦΜ',
        'ΠΙΣΤΩΤΙΚΟ',
        'ΙΔΙΟΚΤΗΤΗΣ',
        'ΔΙΑΦ.ΚΕΡΜ.',
        'ΠΡΟΣΘ',
        'ΦΠΑ ΤΙΜ.',
        'ΗΜΕΡ.ΛΗΞΕΩΣ',
        'ΟΦΕΙΛΗ',
        'ΠΕΡΙΦ.ΓΡΑΦ.',
        'ΤΕΚΜ.',
        'ΗΜΕΡΟΜ.ΕΚΔΟΣΗΣ',
        'ΑΡ.ΠΑΡΑΣΤΑΤΙΚΟΥ',
        'ΔΙΕΥΘΥΝΣΗ',
        'ΤΡΙΜ',
        'ΠΡΟΗΓ.ΕΝΔ.',
        'ΤΥΠΟΣ ΛΟΓΑΡΙΑΣΜΟΥ'
    ]
    
    TIMESERIES_PATH = "data/"
    
    EXPORT_PATH = "data/exports/"
    
    MASTERFILE_PATH = "data/"
    
    PRIMARY_COLOR = "#0db1f2"